; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	thermograph3 - mode
	infrared0 - mode
	thermograph2 - mode
	infrared1 - mode
	image4 - mode
	Star1 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image4)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument3 infrared1)
	(supports instrument3 image4)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(supports instrument5 image4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument6 thermograph3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image4)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite2 Star2)
	(have_image Star5 infrared1)
	(have_image Star6 thermograph3)
	(have_image Phenomenon7 thermograph3)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared0)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 thermograph2)
	(have_image Phenomenon13 thermograph3)
	(have_image Planet14 infrared0)
	(have_image Phenomenon15 thermograph2)
))

)

; plan
1. (turn_to satellite2 star2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star2)
   goals met: 1 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 12
3. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 1 of 12
4. (turn_to satellite1 planet8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet8)
   goals met: 1 of 12
5. (take_image satellite1 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 12
6. (turn_to satellite1 phenomenon7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 12
7. (take_image satellite1 phenomenon7 instrument3 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon13 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 12
9. (take_image satellite1 phenomenon13 instrument3 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 4 of 12
10. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 12
11. (turn_to satellite0 groundstation3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation3)
   goals met: 4 of 12
12. (take_image satellite1 phenomenon11 instrument3 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 5 of 12
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 12
14. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 5 of 12
15. (turn_to satellite0 phenomenon15 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 12
16. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 6 of 12
17. (turn_to satellite0 planet14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
18. (take_image satellite0 planet14 instrument0 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 7 of 12
19. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 7 of 12
20. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 12
21. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 8 of 12
22. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 9 of 12
23. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 9 of 12
24. (take_image satellite0 star9 instrument0 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 12
25. (turn_to satellite1 star5 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star5)
   goals met: 10 of 12
26. (take_image satellite1 star5 instrument3 infrared1)
   added: (have_image star5 infrared1)
   goals met: 11 of 12
27. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 11 of 12
28. (take_image satellite1 star6 instrument3 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 12 of 12
